IDENTIFICATION DIVISION.
PROGRAM-ID. SOMA_MULTIPLICACAO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO-1 PIC 9(3).
01 NUMERO-2 PIC 9(3).
01 NUMERO-3 PIC 9(3).
01 RESULTADO PIC 9(6) USAGE IS DISPLAY.

*> link: https://vjudge.net/problem/CodeChef-LEARNSQL/origin.

PROCEDURE DIVISION.
MAIN-LOGIC.
    ACCEPT NUMERO-1.
    ACCEPT NUMERO-2.
    ACCEPT NUMERO-3.

    COMPUTE RESULTADO = (NUMERO-1 + NUMERO-3) * NUMERO-2.

    MOVE FUNCTION NUMVAL (RESULTADO) TO RESULTADO.

    DISPLAY RESULTADO.

    STOP RUN.
